# StartLocalParameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolylineSegments..::..StartLocalParameter Property
PolylineSegments Class See Also
---
Local parameter associated with the start point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double StartLocalParameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StartLocalParameter As Double
	Get
```

Visual C++
---
```text
public:
property double StartLocalParameter {
	double get ();
}
```

# See Also
PolylineSegments Class
Autodesk.Revit.DB Namespace